# DataFrames

* DataFrames are the workhorse of pandas and are directly inspired by the R programming language. 
* We can think of a DataFrame as a bunch of Series objects put together to share the same index. 
* Let's use pandas to explore this topic!

#### selecting column
#### create new column
#### drop row or column
#### selecting row


####  Syntax -:  pd.DataFrame(data= name_of_list,index=name_of_list, columns=name_of_list)

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A -0.761713  0.079708 -0.765338  0.837547
B -0.822975  2.582822  0.021543 -1.403479
C -0.762337  0.348637  0.266538  1.427554
D -0.568593 -1.295099  0.471774 -0.108812
E  1.974212 -0.895296 -0.200703  1.137613

### Selection and Indexing

using column name:

#### Syntax -:  dataframe_name['column_name']
#### Syntax -:  dataframe_name[['column_name','column_name','column_name']]

In [5]:
df['W']

A   -0.761713
B   -0.822975
C   -0.762337
D   -0.568593
E    1.974212
Name: W, dtype: float64

In [6]:
df[['W','Z']]

          W         Z
A -0.761713  0.837547
B -0.822975 -1.403479
C -0.762337  1.427554
D -0.568593 -0.108812
E  1.974212  1.137613

In [7]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A   -0.761713
B   -0.822975
C   -0.762337
D   -0.568593
E    1.974212
Name: W, dtype: float64

DataFrame Columns are just Series

In [8]:
type(df['W'])

pandas.core.series.Series

#### **Creating a new column:**

#####  Syntax -:  dataframe_name['new_column_name'] = datafrrame_name['column_name'] + dataframe['column_name']

In [9]:
df['new'] = df['W'] + df['Y']

In [10]:
df

          W         X         Y         Z       new
A -0.761713  0.079708 -0.765338  0.837547 -1.527050
B -0.822975  2.582822  0.021543 -1.403479 -0.801432
C -0.762337  0.348637  0.266538  1.427554 -0.495799
D -0.568593 -1.295099  0.471774 -0.108812 -0.096819
E  1.974212 -0.895296 -0.200703  1.137613  1.773508

#### ** Removing Columns**

##### Syntax-:  dataframe_name.drop('name_of_column',axis = 0/1, inplace=  true)    1 for columns and 0 for rows.

In [11]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.761713  0.079708 -0.765338  0.837547
B -0.822975  2.582822  0.021543 -1.403479
C -0.762337  0.348637  0.266538  1.427554
D -0.568593 -1.295099  0.471774 -0.108812
E  1.974212 -0.895296 -0.200703  1.137613

In [12]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -0.761713  0.079708 -0.765338  0.837547 -1.527050
B -0.822975  2.582822  0.021543 -1.403479 -0.801432
C -0.762337  0.348637  0.266538  1.427554 -0.495799
D -0.568593 -1.295099  0.471774 -0.108812 -0.096819
E  1.974212 -0.895296 -0.200703  1.137613  1.773508

Can also drop rows this way:

In [13]:
df.drop('E',axis=0) #Here axis is 0 during column it should be 1.

          W         X         Y         Z       new
A -0.761713  0.079708 -0.765338  0.837547 -1.527050
B -0.822975  2.582822  0.021543 -1.403479 -0.801432
C -0.762337  0.348637  0.266538  1.427554 -0.495799
D -0.568593 -1.295099  0.471774 -0.108812 -0.096819

#### ** Selecting Rows**

#####  Syntax -:  dataFrame_name.loc['row_name']      Based on row name.
##### Syntax -: dataFrame_name.iloc[index]    Based on index of row.

In [14]:
df.loc['A']  #select rows according to name.

W     -0.761713
X      0.079708
Y     -0.765338
Z      0.837547
new   -1.527050
Name: A, dtype: float64

Or select based off of position instead of label

In [15]:
df.iloc[2] #select rows according to position.

W     -0.762337
X      0.348637
Y      0.266538
Z      1.427554
new   -0.495799
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [16]:
df.loc['B','Y']

0.021543368881835563

In [17]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.761713 -0.765338
B -0.822975  0.021543

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [18]:
df

          W         X         Y         Z       new
A -0.761713  0.079708 -0.765338  0.837547 -1.527050
B -0.822975  2.582822  0.021543 -1.403479 -0.801432
C -0.762337  0.348637  0.266538  1.427554 -0.495799
D -0.568593 -1.295099  0.471774 -0.108812 -0.096819
E  1.974212 -0.895296 -0.200703  1.137613  1.773508

In [19]:
df>0

       W      X      Y      Z    new
A  False   True  False   True  False
B  False   True   True  False  False
C  False   True   True   True  False
D  False  False   True  False  False
E   True  False  False   True   True

In [20]:
df[df>0]

          W         X         Y         Z       new
A       NaN  0.079708       NaN  0.837547       NaN
B       NaN  2.582822  0.021543       NaN       NaN
C       NaN  0.348637  0.266538  1.427554       NaN
D       NaN       NaN  0.471774       NaN       NaN
E  1.974212       NaN       NaN  1.137613  1.773508

In [21]:
df[df['W']>0]

          W         X         Y         Z       new
E  1.974212 -0.895296 -0.200703  1.137613  1.773508

In [22]:
df[df['W']>0]['Y']

E   -0.200703
Name: Y, dtype: float64

In [23]:
df[df['W']>0][['Y','X']]

          Y         X
E -0.200703 -0.895296

For two conditions you can use | and & with parenthesis:

In [24]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

## More Index Details

##### Syntax -: dataframe_name.reset_index('list_name')   //   It used for default 0, 1, 2, 3,.... index.
##### Syntax -: dataframe_name.set_index('list_name')   // this used to create new index.

In [25]:
df

          W         X         Y         Z       new
A -0.761713  0.079708 -0.765338  0.837547 -1.527050
B -0.822975  2.582822  0.021543 -1.403479 -0.801432
C -0.762337  0.348637  0.266538  1.427554 -0.495799
D -0.568593 -1.295099  0.471774 -0.108812 -0.096819
E  1.974212 -0.895296 -0.200703  1.137613  1.773508

In [26]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z       new
0     A -0.761713  0.079708 -0.765338  0.837547 -1.527050
1     B -0.822975  2.582822  0.021543 -1.403479 -0.801432
2     C -0.762337  0.348637  0.266538  1.427554 -0.495799
3     D -0.568593 -1.295099  0.471774 -0.108812 -0.096819
4     E  1.974212 -0.895296 -0.200703  1.137613  1.773508

In [27]:
newind = 'CA NY WY OR CO'.split()

In [28]:
df['States'] = newind

In [29]:
df

          W         X         Y         Z       new States
A -0.761713  0.079708 -0.765338  0.837547 -1.527050     CA
B -0.822975  2.582822  0.021543 -1.403479 -0.801432     NY
C -0.762337  0.348637  0.266538  1.427554 -0.495799     WY
D -0.568593 -1.295099  0.471774 -0.108812 -0.096819     OR
E  1.974212 -0.895296 -0.200703  1.137613  1.773508     CO

In [30]:
df.set_index('States')

               W         X         Y         Z       new
States
CA     -0.761713  0.079708 -0.765338  0.837547 -1.527050
NY     -0.822975  2.582822  0.021543 -1.403479 -0.801432
WY     -0.762337  0.348637  0.266538  1.427554 -0.495799
OR     -0.568593 -1.295099  0.471774 -0.108812 -0.096819
CO      1.974212 -0.895296 -0.200703  1.137613  1.773508

In [31]:
df

          W         X         Y         Z       new States
A -0.761713  0.079708 -0.765338  0.837547 -1.527050     CA
B -0.822975  2.582822  0.021543 -1.403479 -0.801432     NY
C -0.762337  0.348637  0.266538  1.427554 -0.495799     WY
D -0.568593 -1.295099  0.471774 -0.108812 -0.096819     OR
E  1.974212 -0.895296 -0.200703  1.137613  1.773508     CO

In [32]:
df.set_index('States',inplace=True)

In [33]:
df

               W         X         Y         Z       new
States
CA     -0.761713  0.079708 -0.765338  0.837547 -1.527050
NY     -0.822975  2.582822  0.021543 -1.403479 -0.801432
WY     -0.762337  0.348637  0.266538  1.427554 -0.495799
OR     -0.568593 -1.295099  0.471774 -0.108812 -0.096819
CO      1.974212 -0.895296 -0.200703  1.137613  1.773508

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [34]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [35]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [36]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.769379  1.302614
   2  0.161115  0.614967
   3 -0.573557  0.450218
G2 1  0.054862  1.992518
   2  1.454307 -0.003126
   3  1.906602  0.108675

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [37]:
df.loc['G1']

          A         B
1 -0.769379  1.302614
2  0.161115  0.614967
3 -0.573557  0.450218

In [38]:
df.loc['G1'].loc[1]

A   -0.769379
B    1.302614
Name: 1, dtype: float64

In [39]:
df.index.names

FrozenList([None, None])

In [40]:
df.index.names = ['Group','Num']

In [41]:
df

                  A         B
Group Num
G1    1   -0.769379  1.302614
      2    0.161115  0.614967
      3   -0.573557  0.450218
G2    1    0.054862  1.992518
      2    1.454307 -0.003126
      3    1.906602  0.108675

In [42]:
df.xs('G1')

            A         B
Num
1   -0.769379  1.302614
2    0.161115  0.614967
3   -0.573557  0.450218

In [43]:
df.xs(['G1',1])

A   -0.769379
B    1.302614
Name: (G1, 1), dtype: float64

In [44]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.769379  1.302614
G2     0.054862  1.992518

# Great Job!